
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/a-itabashi/aws-ecs-terraform/actions/runs/14151877978)



<pre><code>Apply complete! Resources: 7 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.aws_iam_policy_document.ecs_assume: Reading...
data.aws_iam_policy_document.ecs_task_assume: Reading...
aws_ecr_repository.ecr_repository: Refreshing state... [id=go-simple-server]
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01d2f3607d1897c0b]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=go-simple-server]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d9f484e26ad70778]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-005b54589c2b6da5f]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-030a489d8399a107a]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0459a6c028894452a]
aws_security_group.alb: Refreshing state... [id=sg-012c8de90de2f8baf]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-07a0d641cf5155989]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-09569d2eb812a2f7d]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0ecb407aff77341b6]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-04a005e3c981f9801]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:targetgroup/go-simple-server-target-group/061c4d8d8e9b52ed]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0e65c15767a8f3803]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-08a9a127f143f34c0]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06c8865a563239fd1]
aws_security_group.ecs: Refreshing state... [id=sg-041f8ed7691d70ce5]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f4ab1a1c01510657]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-018ff3bbcd43e1f97]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-04a005e3c981f98011080289494]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ab9ee2a722845733]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c2656be80ccf73b5]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e182b46e28a84380]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-094ec60ad1531eeb5]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:loadbalancer/app/go-simple-server-alb/ae567f9e14a6567d]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-844562651]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-00d6b7549b076f2d9]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-04ba37f781522f10e]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0459a6c028894452a1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-030a489d8399a107a1080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:listener/app/go-simple-server-alb/ae567f9e14a6567d/e9917478e49912ee]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:listener-rule/app/go-simple-server-alb/ae567f9e14a6567d/e9917478e49912ee/1c3d616d3793774e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/go-simple-server"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "go-simple-server"
      + tags_all = (known after apply)

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "go-simple-server"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "go-simple-server"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:targetgroup/go-simple-server-target-group/061c4d8d8e9b52ed"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-041f8ed7691d70ce5",
            ]
          + subnets          = [
              + "subnet-08a9a127f143f34c0",
              + "subnet-0e65c15767a8f3803",
            ]
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "HEALTH_CHECK_PATH"
                          + value = "/health_checks"
                        },
                      + {
                          + name  = "NGINX_PORT"
                          + value = "8080"
                        },
                    ]
                  + image            = "medpeer/health_check:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/go-simple-server"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "go-simple-server"
                        }
                    }
                  + name             = "go-simple-server"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "go-simple-server"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ecs_basic will be created
  + resource "aws_iam_role_policy_attachment" "ecs_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "go-simple-server-ecs"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
aws_ecs_cluster.ecs_cluster: Creating...
aws_iam_role.ecs_task: Creating...
aws_iam_role.ecs: Creating...
aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
aws_iam_role.ecs_task: Creation complete after 0s [id=go-simple-server-ecs-task]
aws_iam_role.ecs: Creation complete after 0s [id=go-simple-server-ecs]
aws_iam_role_policy_attachment.ecs_basic: Creating...
aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 0s [id=/aws/ecs/go-simple-server]
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_iam_role_policy_attachment.ecs_basic: Creation complete after 1s [id=go-simple-server-ecs-20250330024738464800000001]
aws_ecs_task_definition.ecs_task_definition: Creation complete after 1s [id=go-simple-server]
aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
aws_ecs_cluster.ecs_cluster: Creation complete after 11s [id=arn:aws:ecs:ap-northeast-1:683134287515:cluster/go-simple-server]
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 1s [id=arn:aws:ecs:ap-northeast-1:683134287515:service/go-simple-server/go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":6,"Program":"tfcmt","SHA1":"f1fd0d94359e4c2bb81aca324c38aaada0fc59f5","Vars":{},"WorkflowName":"Terraform"} -->